Repository: Magum23/e-invoice-eu
Catalog: packages/docs/_po/*.po
Languages: de

source: The functionality is hidden behind a paperclip icon at the right side of the window. Clicking it reveals the list of attachments to the document. In this case, not only the XML invoice file but an additional file for informational purposes is attached, too.
de: Die Funktionalität verbirgrt sich hinter einem Büroklammer-Icons auf der rechten Seite des Fensters. Ein Klick darauf zeigt die Anhänge an das Dokument an. In diesem Fall ist nicht nur die XML-Rechnung sondern auch eine zusätzliche Datei zu Informationszwecken angehangen.

source: ## CII is Mandatory for Factur-X/ZUGFeRD
de: ## CII ist für Factur-x/ZUGFeRD zwingend

source: Unfortunately, Factur-X/ZUGFeRD does not leave a choice between [% q.lanchor(name='ubl') %] and [% q.lanchor(name='cii') %]. CII is the mandatory syntax for the embedded XML.
de: Leider erlaubt Factur-X/ZUGFeRD nicht, zwischen [% q.lanchor(name='ubl') %] und [% q.lanchor(name='cii') %] zu wählen. CII ist als Syntax für das eingebettete XML zwingend vorgeschrieben.

source: But even with the attached XML file, a PDF does not automatically qualify as a valid electronic invoice. A PDF file may look different on different devices. For example it may not embed all fonts used but reference a font that is expected to be installed on the particular device. If the font is missing, a replacement font is chosen by the renderer.
de: Aber auch eine angehängte XML-Datei qualifiziert ein PDF nicht automatisch als gültige elektronische Rechnung. Ein PDF kann auf unterschiedlichen Geräten unterschiedlich aussehen. Zum Beispiel könnten Zeichensätze nicht eingebettet sondern lediglich referenziert sein, in der Erwartung, dass der entsprechende Zeichensatz auf dem Gerät installiert ist. Fehler dieser, wählt der Renderer einen Ersatzzeichensatz.

source: If a PDF fulfills the PDF/A standard, all fonts must be embedded and also a couple of other requirements have to be fulfilled so that it is guaranteed that the PDF will look exactly the same on every device, even in the future, so that the documents are *revision-safe*.
de: Erfüllt ein PDF den PDF/A-Standard, müssen alle Zeichensätze eingebettet sein. Daneben müssen noch eine Reihe weiterer Anforderungen erfüllt sein, um sicherzustellen, dass das PDF auf jedem Gerät exakt gleich aussieht, selbst in der Zukunft. Damit ist die Revisionssicherheit des Dokuments gewährleistet.

source: Validating Factur-X/ZUGFeRD Invoices therefore involves two steps. First, compliance with the PDF/A standard is checked. Second, the attached XML undergoes the normal checks as pure XML documents.
de: Die Validierung von Factur-X/ZUGFeRD-Rechnungen erfordert deshalb zwei Schritte. Zunächst wird überprüft, dass das Dokument dem PDF/A-Standard entspricht. Zweitens wird das angehängte XML der normalen Prüfung für XML-Dokumente unterzogen.

source: In fact, a third check is required. PDFs contain meta information in the Extensible Metadata Platform XMP format, and that meta data has to contain certain extra information for Factur-X/ZUGFeRD.
de: Tatsächlich ist sogar noch eine dritte Prüfung erforderlich. PDFs enthalten Meta-Informationen im Format XMP (*Extensible Metadata Platform*, also erweiterbare Metadaten-Plattformm), und diese Metadaten müssen für Factur-X/ZUGFeRD gewisse Zusatzinformationen enthalten.

source: ## Profiles (Conformance Levels)
de: ## Profile (Konformitätsstufen)

source: The standard allows for 6 different conformance levels called profiles:
de: Der Standard sieht 6 verschiedene Konformitätsstufen, Profile genannt, vor:

source: * Minimum * Basic WL * Basic * EN 16931 (formerly known as Comfort) * Extended * XRechnung
de: * Minimum * Basic WL * Basic * EN 16931 (früher Comfort genannt) * Extended * XRechnung

source: Each profile restricts the number of allowed CII elements to a certain subset. "Minimum" is the smallest subset and "Extended" the largest. The profile "XRechnung" seems to allow the full range of CII elements although the documentation is not clear about that.
de: Jedes Profil schränkt die Menge der erlaubten CII-Element auf eine gewisse Untermenge ein. ”Minimum” ist die kleinste Untermenge und ”Extended” die größte. Das Profil ”XRechnung” scheint alle CII-Elemente zu erleuben, wenngleich das aus der Dokumentation nicht klar hervorgeht.

source: The profiles "Minimum" and "Basic WL" do not contain enough information for a valid invoice according to VAT legislation but are considered *accounting aids*.
de: Die Profile ”Minimum” und ”Basic WL” enthalten nicht genügend Informationen für eine der Umsatzsteuergesetzgebung entsprechende Rechnung und werden deshalb als Buchungshilfen betrachtet.

source: [% title = "Purpose of Profiles" %]
de: [% title = "Sinn von Profilen" %]

source: When a data format allows optional information, the common approach in the software industry is to recommend that readers of the data should simply ignore those parts that are not relevant for a particular application. The strategy chosen by Factur-X/ZUGFeRD, however, makes things unnecessarily complicated.
de: Wenn ein Datenformat optionale Informationen erlaubt, ist der normale Ansatz in der Software-Industrie, dass lesende Programme Teile, die für die jeweilige Anwendung nicht relevant sind, einfach ignorieren. Die Strategie, die von Factur-X/ZUGFeRD gewählt wurde, macht dagegen die Dinge unnötig kompliziert.

source: ## Discrepancies Between PDF and XML
de: ## Diskrepanzen zwischen PDF und XML

source: Factur-X/ZUGFeRD invoices look like regular PDFs and recipients may not even know that the documents contain an XML version of it. The German ministry of Finance stipulates that the PDF and XML versions must be content-identical counterparts (German: *inhaltsgleiche Mehrstücke*). It is still unclear how courts will assess any discrepancies between the two versions.
de: Factur-X/ZUGFeRD-Rechnungen sehen wie reguläre PDFs aus. und Empfängerinnen und Empfänger bemerken möglicherweise nicht einmal, dass die Dokmente eine XML-Version des Dokuments enthalten. Das deutsche Bundesministerium für Finanzen fordert deshalb, dass es sich bei den PDF- und XML-Versionen um *inhaltsgleiche Mehrstücke* handelt. Es bleibt abzuwarten, wie die Rechtsprechung Abweichungen zwischen den beiden Versionen bewertet.

source: ## Documentation
de: ## Dokumentation

source: You can download the documentation for Factur-X from https://fnfe-mpe.org/factur-x/factur-x_en/. The docs for the German counterpart ZUGFeRD are available from https://www.ferd-net.de/. You have to enter a valid e-mail address in order to be able to download the documentation. The exact links frequently change. Please use a search engine!
de: Die Dokumentation für Factur-X kann von https://fnfe-mpe.org/factur-x/factur-x_en/ heruntergeladen werden. Die Doku für das deutsche Gegenstück ZUGFeRD steht auf https://www.ferd-net.de/ zum Download zur Verfügung. Um die Dokumentation herunterzuladen, ist jeweils die Angabe einer gültigen E-Mail-Adresse erforderlich. Die genauen Links ändern sich häufig, lassen sich aber mit einer Suchmaschine leicht finden.

source: [% title = "Quality of the Documentation" %]
de: [% title = "Qualität der Dokumentation" %]

source: Although Factur-X and ZUGFeRD are now identical standards, there is both a French and German version of the documentation with different structure. The structure of the documentation fundamentally changes with every release and occasionally even contains garbage like <code>.DS_Store</code> files from the Mac where stuff has been zipped.
de: Obwohl es sich bei Factur-X und ZUGFeRD mittlerweile um identische Standards handelt, gibt es sowohl eine französische als auch eine deutsche Version der Dokumentation mit jeweils unterschiedlich Struktur. Die Struktur der Dokumentation ändert sich mit jedem Release grundlegend und enthalt auch schon einmal Müll wie <code>.DS_Store</code>-Dateien vom Mac, wo die Doku gezippt wurde.

# description
source: E-Invoice-EU supports e-invoice formats that conform to the European standard EN16931.
de: E-Invoice-EU unterstützte E-Rechnungs-Formate, die der europäischen Norm EN16931 entsprechen.

source: There are different approaches to distinguish e-invoice formats.
de: Es gibt unterschiedliche Ansätze, um E-Rechnungs-Formate zu unterscheiden.

source: ## XML Formats
de: ## XML-Formate

source: Not every electronic invoice document qualifies as an e-invoice in the sense of the European standard EN16931. They have to be XML documents using one of the syntaxes [UBL]([% q.llink(name='ubl') %]) or [CII]([% q.llink(name='cii') %]).
de: Nicht jedes elektronische Rechnungs-Dokument ist eine E-Rechnung im Sinne der europäischen Norm EN16931. Es muss sich vielmehr um XML-Dokumente mit einer der Syntaxen [UBL]([% q.llink(name='ubl') %]) oder [CII]([% q.llink(name='cii') %]) handeln.

source: What is meant with syntax? A UBL and a CII invoice can contain the exact same information. What differs is the name of the XML elements and their location in the document object model.
de: Was ist unter Syntax zu verstehen? Eine UBL- und CII-Rechnung kann exakt die gleiche Information enthalten. Was sich unterscheidet, sind die Namen der XML-Element und ihre Position im Dokumenten-Objekt-Modell.

source: Both UBL and CII allow embedding a human-readable, normally PDF version of the invoice to be embedded in the XML.
de: Sowohl UBL als auch CII erlauben die Einbettung einer menschlich-lesbaren, normalerweise PDF-Version der Rechnung im XML.

source: ## Hybrid Formats (Factur-X/ZUGFeRD)
de: ## Hybride Formate (Factur-X/ZUGFeRD)

source: In France and Germany, the standards [Factur-X and ZUGFeRD]([% q.llink(name='factur-x-zugferd') %]) for e-invoices have been developed. Both Factur-X and ZUGFeRD documents are actually PDF invoice documents but they contain an equivalent XML version of the invoice as an attachment to the PDF.
de: In Frankreich und Deutschland wurden die Standards [Factur-X und ZUGFeRD]([% q.llink(name='factur-x-zugferd') %]) für E-Rechnungen entwickelt. Sowohl bei Factur-X- als auch bei ZUGFeRD-Dokumenten handelt es sich eigentlich um PDF-Rechnungs-Dokumente. Sie enthalten jedoch eine äquivalente XML-Version der Rechnung als Anhang an das PDF.

source: Factur-X and ZUGFeRD are nowadays identical standards. They are just different names for the same thing. Factur-X is the official name but the term ZUGFeRD is still prevalent in Germany.
de: Factur-X und ZUGFeRD sind mittlerweile identische Standards. Es handelt sich lediglich um unterschiedliche Namen für dieselbe Sache. Factur-X ist der offiziellen Name. Dennoch ist die Bezeichnung ZUGFeRD in Deutschland noch immer vorherrschend.

source: ## Takeaway
de: ## Fazit

source: An electronic invoice is either an XML document in one of the flavours UBL and CII or a Factur-X/ZUGFeRD PDF. If you opt for an XML version you *may* include a PDF version. If you go with the hybrid format Factur-X/ZUGFeRD you *must* include an XML version of the invoice.
de: Eine elektronische Rechnung ist entweder ein XML-Dokumenten in einer der Varianten UBL und CII oder ein Factur-X/ZUGFeRD-PDF. Entscheidet man sich für eine XML-Variante, *kann* eine PDF-Version eingebettet werden. Beim hybriden Format Factur-X/ZUGFeRD *muss* eine XML-Version der Rechnung eingebettet werden.

# description
source: UBL stands for Universal Business Language
de: UBL steht für *Universal Business Language*, also universelle Geschäftssprache

source: UBL is an XML syntax for many different business documents, among others invoices and credit notes. E-Invoice-EU currently only supports invoices.
de: Bei UBL handelt es sich um eine XML-Syntax für viele verschiedene Geschäftsdokumente, unter anderem Rechnungen und Gutschriften. E-Invoice-EU unterstützt derzeit nur Gutschriften.

source: The format is well documented by Peppol at https://docs.peppol.eu/poacc/billing/3.0/syntax/ubl-invoice/.
de: Das Format ist unter https://docs.peppol.eu/poacc/billing/3.0/syntax/ubl-invoice/ von Peppol gut dokumentiert.

source: [% title = "Official UBL Documentation" %]
de: [% title = "Offizielle UBL-Dokumentation" %]

source: The current official documentation of UBL is available as an [OASIS Standards Document](http://docs.oasis-open.org/ubl/UBL-2.1.html). But it is not very helpful in the context of electronic invoices in the EU because the EU has additional requirements. It is therefore recommended to use the Peppol documentation.
de: Die aktuelle offizielle Dokumentation von UBL ist als [OASIS Standards Document](http://docs.oasis-open.org/ubl/UBL-2.1.html) verfügbar. Das ist allerdings im Kontext elektronischer Rechnungen in der EU nur wenig hilfreich, weil die EU eigene Anforderungen hat. Es wird daher empfohlen, die Peppol-Dokumentation zu verwenden.

source: Clicking on an element name opens the documentation for the element. If the name of an element begins with `cac:`, it has subelements. If the name starts with `cbc:` it is the name of a leaf element. It makes sense to get familiar with this documentation because the Peppol UBL invoice structure is also the basis for the internal invoice format of E-Invoice-EU.
de: Ein Klick auf den Namen eines Elements öffnet die Dokumentation für das Element. Elemente, deren Namen mit `cac:` beginnen, haben Unterelemente. Diese deren Namen mit `cbc:` beginnen, sind Blätter. Es ist sinnvoll, sich mit dieser Dokumentation vertraut zu machen, weil die Struktur der Peppol-UBL-Rechnung die Grundlage für das interne Rechnungsformat von E-Invoice-EU ist.

# description
source: Free and open source tool chain for generating EN16931 conforming invoices (Factur-X/ZUGFeRD, UBL, CII, XRechnung) from popular spreadsheet formats or JSON.
de: Freie und quelloffene Software-Suite zur Generierung von EN16931-konformen Rechnungen (Factur-X/ZUGFeRD, UBL, CII, XRechnung) aus populären Tabellenkalkulationsformaten oder JSON.

source: [% title = "Incomplete Translation!" %]
de: [% title = "Unvollständige Übersetzung!" %]

source: The translation for this site is not yet ready. The parts that are not yet translated will be displayed in English instead.
de: Die Übersetzung für diese Site ist noch nicht fertiggestellt. Noch nicht übersetzte Passagen werden daher auf Englisch angeboten.

source: * E-Invoice generation from popular Spreadsheet formats or JSON. * Supports all electronic invoice formats conforming to EU standard EN16931, notably Factur-X/ZUGFeRD, UBL, and CII. * Written in TypeScript/JavaScript. * Large parts of the code are generated from PEPPOL-UBL documentation. * Automatic valdiation of input document structure. * OpenAPI/Swagger API documentation included.
de: * E-Rechnungen werden aus populären Tabellenkalkulationsformaten oder JSON generiert. * Untertütze alle elektronischen Rechnungsformate, die dem EU-Standard EN16931 entsprechen, also Factur-X/ZUGFeRD, UBL, and CII. * In TypeScript/JavaScript geschrieben. * Große Teile des Programmcodes werden aus der aktuellen PEPPOL-UBL-Dokumentation generiert. * Automatische Validierung der Eingabedokumenten-Struktur. * OpenAPI/Swagger-API-Documentation enthalten.

# title
source: Service
de: Dienst (Service)

# title
source: API Documentation
de: ## API-Dokumentation

# description
source: The OpenAPI (Swagger) documentation is built into the server.
de: Die OpenAPI-/Swagger-Dokumentation ist in den Server eingebaut.

source: The service uses the [OpenAPI](https://www.openapis.org/) specification to document its API.
de: Der Service verwendet die [OpenAPI](https://www.openapis.org/)-Spezifikjation zur Dokumentation des Application Program Interfaces (API).

source: After [starting the service]([% q.llink(name='deployment') %]), the API documentation is available at http://localhost:8080/api. Hostname, scheme, and port have to be changed accordingly, depending where you have deployed the service.
de: Nachdem [der Dienst gestartet wurde]([% q.llink(name=’deployment’) %]), ist die Schnittstellendokumentation unter http://localhost:8080/api verfübar. Hostname, Schema und Port müssen entsprechend geändert werden, je nachdem, wo der Service läuft.

source: It is also possible to try out the individual endpoints in the browser.
de: Es ist auch möglich, individuelle Endpunkte im Browser auszuprobieren.

source: [% FILTER $Srcset alt="API documentation for /api/format/list" %]/images/service/api-documentation/openapi-format-docs.webp[% END %]
de: [% FILTER $Srcset alt=”API-Dokumentation für /api/format/list” %]/images/service/api-documentation/openapi-format-docs.webp[% END %]

# title
source: Deployment
de: Ausrollen (Deployment)

# description
source: You can deploy the service either as a container or run it locally in production or development mode.
de: Der Dienst kann entweder als Container lokal im Produktions- oder Entwicklungsmodus gestartet werden.

source: The E-Invoice-EU service can be used in one of several ways:
de: Der Dienst E-Invoice-EU kann auf eine von mehreren Arten gestartet werden:

source: * Run as a (docker) container. * Build and run it in production mode. * Run it locally in development mode.
de: * Als (Docker-)Container. * Kompiliert im Produktionsmodus. * Lokal im Entwicklungsmodus.

source: By far, the easiest way to run the E-Invoice-EU service is to run the containerized version.
de: Die Verwendung der containerisierten Version ist die bei weitem einfachste Möglichkeit, den Service E-Invoice-EU zu starten.

source: ## Deploy in Production Mode
de: ## Ausrollen im Produktions-Modus

source: You can also build the server and then run it anywhere you like. After cloning the repository and changing into its root directory, execute the following commands:
de: Man kann den Server auch bauen und dann an einem beliebigen Ort starten. Nach dem Clonen des Repositories und Wechsel in dessen Wurzelverzeichnis, müssen dazu die folgenden Kommandos in eine Shell eingegeben werden:

source: You can then run the application with your favourite JavaScript runtime environment.
de: Die Applikation kann dann mit einer beliebigen JavaScript-Laufzeitumgebung gestartet werden:

source: See the [NestJS documentation for deployment](https://docs.nestjs.com/deployment) for more information.
de: Die [NestJS-Dokumentation für Deployment](https://docs.nestjs.com/deployment) hält weitere Informationen bereit.

source: ## Run in Development Mode
de: ## Im Entwicklungsmodus starten

source: You can also run the application without building it first.
de: Die Applikation kann auch ohne den vorherigen Build-Schritt gestartet werden.

source: This will automatically re-compile the source code and re-start the server, whenever you make changes to the code.
de: In diesem Modus wird, wannimmer der Quelltext geändert wurde, alles neu kompiliert und der Server neu gestartet.

source: ## Environment Variables
de: ## Umgebungsvariablen

source: The following environment variables are supported:
de: Die folgenden Umgebungsvariablen werden unterstützt:

source: To quote the NestJS documentation:
de: Um die NestJS-Dokumentation zu zitieren:

source: > While there's technically no difference between development and production in Node.js and NestJS, it's a good practice to set the NODE_ENV environment variable to production when running your application in a production environment, as some libraries in the ecosystem may behave differently based on this variable (e.g., enabling or disabling debugging output, etc.).
de: > Während es technisch keinen Unterschied zwischen Entwicklungs- und Produktionsmodus in Node.js und NestJS gibt, ist es ein gute Proxis, die NODE_ENV Umgebungsvariable auf ”production” zu setzen, wenn die Applikation in einer Produktionsumgebung gestartet wird, weil einige Bibliotheken im Ökosystem ihr Verhalten basierend auf dieser Variablen ändern (z.&nbsp;B. Ein- und Ausschalten von Debugging-Ausgaben, usw.).

source: In brief: Set the environment variable to "production", when running the service in production mode.
de: Kurz gesagt: Es ist besser, diese Variable auf ”production” zu setzen, wenn die Applikation im Produktionsmodus gestartet wird.

source: Set this to a valid port number if you are not happy with the default port of 3000.
de: Wenn der Standard-Port 3000 nicht passt, kann hier eine andere Portnummer angegeben werden.

source: Note: This has currently no effect, when running the service in a container, see https://github.com/gflohr/e-invoice-eu/issues/76.
de: Anmerkung: Dies hat zur Zeit keine Auswirkung, wenn die Applikation als Container gestartet wird, siehe https://github.com/gflohr/e-invoice-eu/issues/76.

# title
source: Legal Disclosure
de: Impressum

# description
source: Imprint
de: Impressum

source: ## Company Information
de: ## Informationen zur Firma

source: Bulgaria<br>
de: Bulgarien<br>

source: VAT-ID [% config.legal.vat_id %]<br>
de: USt-ID [% config.legal_vat_id %]<br>

source: Manager: [% config.legal.manager %]
de: Geschäftsführer: [% config.legal.manager %]

source: ## Contact
de: ## Kontakt

source: - email: [% config.legal.email %] - phone: [% config.legal.phone %]
de: - E-mail: [% config.legal.email %] - Telefon: [% config.legal.phone %]

source: ## Responsible for the content:
de: ## Verantwortlich für den Inhalt:
