Repository: Magum23/e-invoice-eu
Catalog: packages/docs/_po/*.po
Languages: de

source: Copy code
de: Quelltext kopieren

source: type:
de: Typ:

source: overridable:
de: Überschreibbar:

source: %B, %e %Y
de: %e. %B %Y

source: Read More
de: Weiterlesen

source: Table Of Contents
de: Inhaltsverzeichnis

source: Cookie Settings
de: Cookie-Einstellungen

source: Stars on GitHub
de: Sterne auf Github

source: Stars
de: Stern

source: Source code of this page
de: Quelltext dieser Seite

source: Toggle navigation
de: Navigation ein/aus

source: E-Invoice-EU Documentation
de: E-Invoice-EU-Dokumentation

source: Home
de: Start

source: Docs
de: Doku

source: E-Invoice-EU on GitHub
de: E-Invoice-EU auf Github

# title
source: Data Privacy
de: Datenschutz

# description
source: What private date does this site receive, and what does it use it for?
de: Welche privaten Daten werden an diese Website geschickt, und wofür werden sie verwendet?

source: You cannot download any data or information from the internet without sending data or information first. This page tries to inform you what information is collected related to your visit.
de: Aus dem Internet lassen sich keine Daten oder Informationen herunterladen, ohne zuerst Daten oder Informationen zu schicken. Diese Seite informiert darüber, welche Daten im Zusammenhang mit einem Besuch dieser Seite erfasst werden.

source: ## Logging
de: ## Protokolldateien

source: Like most web sites, this site stores information about every request in a server log file, a file stored on the web server. Visiting one single page typically results in multiple requests, for textual content, images or other media, script files, style sheets and so on.
de: Wie fast alle Web-Sites speichert auch diese Informationen über jede Anfragen in Protokolldateien auf dem Web-Server. Der Besuch einer einzigen Seite führt in der Regel zu einer Vielzahl von Einzelanfragen, für Texte, Bilder oder andere Medien, Skriptdateien, Style-Sheets und so weiter.

source: ### What Is Stored?
de: ### Was wird gespeichert?

source: The following pieces of information sent by your browser are stored:
de: Die folgenden vom Browser übermittelten Informationen werden gespeichert:

source: - Your IP address. This address identifies your computer or other device while you are connected to the internet. Your internet service provider (ISP) has the legal duty to store information about which IP address was assigned to which customer for a certain time in most countries. - The date and time of the request with an accuracy of one second. - The address of the resource. - Information about the browser and operating systems you are using and their respective versions. See the documentation of your browser if you want to suppress sending that information. - In case that you visited the page by clicking a link, information about the referring web site. See the documentation of your browser if you want to suppress sending that information.
de: - Die IP-Adresse. Diese Adresse identifiziert den Computer oder auch andere Geräte weltweit, solange eine Verbindung zum Internet besteht. Der Internetanbieter (Internet Service Provider ISP) unterliegt der rechtlichen Verpflichtung, die Zuordnung einer IP-Adresse zu einem individuellen Kunde für eine gewisse Zeit zu speichern. - Datum und Uhrzeit der Anfrage mit einer Genauigkeit von einer Sekunde. - Die Adresse der angefragten Ressource. - Informationen über Browser und Betriebssystem und deren jeweilige Versionen. Die Dokumentation des Browsers enthält Hinweise dafür, wie sich die Übermittlung dieser Daten unterdrücken lässt. - Wurde diese Web-Site durch Klicken eines Links annavigiert, wird in der Regel auch übermittelt, von welcher Web-Adresse (URL) aus dies geschah. Die Dokumentation des Browsers enthält Hinweise dafür, wie sich die Übermittlung dieser Daten unterdrücken lässt.

source: All this information is stored for technical purposes only, such as analysis of technial problems.
de: Alle diese Informationen werden lediglich für technische Zwecke, zum Beispiel der Analyse technischer Probleme erfasst.

source: Note that suppressing your IP address does not make sense. Any server needs it as the address to which it should send the requested data. The purpose of the IP address is not to disrupt your privacy but it is needed for any communication on the internet.
de: Beachten Sie bitte, dass ein Unterdrücken der IP-Adresse nicht sinnvoll möglich ist, da diese Adresse zur Rücksendung der Antwort auf die Anfrage benötigt wird. Sinn der IP-Adresse ist es nicht, die Privatsphäre zu beeinträchtigen. Sie ist vielmehr essenziell für jegliche Kommunikation im Internet.

source: ### How Long Is It Stored?
de: ### Wie lange werden Daten gespeichert?

source: Log files are ultimately deleted after at most six months.
de: Protokolldateien werden nach spätestens sechs Monaten gelöscht.

source: ### What are Cookies?
de: ### Was sind Cookies?

source: Cookies are little pieces of information that the site sends to your browser. The browser stores this information in a file or in memory, and sends it back to the server with all following requests until the cookie expires or the browser is instructed to delete it.
de: Cookies sind kleine Informationenhappen, die von einer Web-Site an den Browser gesendet werden. Der Browser speichert diese Informationen in einer Datei oder im Speicher und sendet sie mit allen folgenden Anfragen an den Server zurück, bis entweder der Gültigkeitszeitraum des Cookies abgelaufen ist oder der Browser zur Löschung instruiert wird.

source: Typical examples for information stored in cookies are language preferences or for example the content of a shopping cart.
de: Typische Beispiele für in Cookies gespeicherte Informationen sind Beispielsweise Spracheinstellungen oder der Inhalt eines Warenkorbes.

source: ### How Can You Disable Cookies?
de: ### Wie lassen sich Cookies abschalten?

source: Please see your browser's documentation for information about how to disable cookies in general, for specific sites, or from specific sources.
de: Die Dokumentation des Browsers beschreibt, wie sich Cookies allgemein, für bestimmte Web-Sites oder von bestimmten Quellen abschalten lassen.

source: This website uses Matomo, a web tracking and analysis service.
de: Diese Website nutzt Matomo ein Webtracking- und Analysedienst.

source: Matomo also uses cookies (see above) for storing information about your use of this site. The information stored in these cookies is sent to sent to a server owned by [cantanea EOOD](https://www.cantanea.com/).
de: Auch Matomo nutzt Cookies (siehe oben), um Informationen über Ihre Nutzung der Web-Site zu speichern. Die Informationen, die in diesen Cookies gespeichert ist, wird an einen Server der [cantanea EOOD](https://www.cantanea.com/) übermittelt.

source: ### Data Usage
de: ## Verwendung der Daten

source: Matomo uses the information for analyzing your usage of this site. It compiles reports on the website activities and the audience of the site, and provides other services concerning the use of the website and internet usage in general.
de: Matomo verwendet diese Informationen, um Ihre Nutzung der Web-Site zu analysieren, Berichte über die Website-Aktivitäten und das Publikum der Site zusammenzustellen und stellt weitere die Verwendung der Web-Site betreffende Dienste und die Benutzung des Internets im Allgemeinen zur Verfügung.

source: ### IP Abbreviation
de: ### IP-Kürzung

source: Matomo does not store your full IP address but only a part of it. If your IP address is, for example, 12.34.56.78, it will be stored as 12.34.0.0.
de: Matomo speichert keine vollen IP-Adressen, sondern nur einen Teil davon. Zum Beispiel würde die IP-Adresse 12.34.56.78 also 12.34.0.0 gespeichert.

# title
source: Basics
de: Grundlagen

# title
source: General Mode of Operation
de: Generelle Funktionsweise

# description
source: The software works by mapping spreadsheet data to JSON data from which the e-invoice is generated. You can also directly generate the e-invoice from JSON.
de: Die Software bildet Daten aus einer Tabellenkalkulation auf JSON ab, aus der die E-Rechnung generiert wird. Die Rechnung kann aber auch direkt aus JSON erzeugt werden.

source: [% FILTER $Srcset alt="Flowchart of E-Invoice-EU General Mode of Operation" %]/images/basics/general-mode-of-operation/flow-chart.webp[% END %]
de: [% FILTER $Srcset alt="Flowchart der generellen Funktionsweise von E-Invoice-EU" %]/images/basics/general-mode-of-operation/flow-chart.webp[% END %]

source: The software was created under the assumption that many small businesses create their invoices with the help of spreadsheet software like [LibreOffice](https://www.libreoffice.org/). That means that the invoice data is already available as structured data.
de: Die Software wurde unter der Annahme erstellt, dass viele kleine Firmen ihre Rechnungen mit Hilfe einer Tabellenkalkulation wie [LibreOffice](https://www.libreoffice.org/) erstellen. Das bedeutet, dass die Rechnungsdaten schon in strukturierter Form vorliegen.

source: All that was left to be done was to map the input spreadsheet data to elements in the output XML of the electronic invoice. Because there are multiple supported output XML formats, it makes sense to first map the input data into a general internal format and then render the data into the desired output format.
de: Damit müssen lediglich noch die Eingabedaten aus der Tabellenkalkulation auf das Ausgabe-XML der elektronischen Rechnung abgebildet werden. Weil mehrere XML-Ausgabe-Formate unterstützt werden, ist es sinnvoll, die Eingabedaten zunächst auf ein allgemeines internes Format abzubilden, und daraus dann das gewünschte Ausgabeformat zu generieren.

source: The internal format chosen is largely equivalent to that of [Peppol UBL](https://docs.peppol.eu/poacc/billing/3.0/syntax/ubl-invoice/). The advantages are:
de: Das gewählte interne Format ist größtenteils äquivalent zu [Peppol UBL](https://docs.peppol.eu/poacc/billing/3.0/syntax/ubl-invoice/). Das hat Vorteile:

source: * The documentation is browsable and relatively easy to understand. * It is generated from data (see https://github.com/OpenPEPPOL/peppol-bis-invoice-3) that also allows generating [JSON schema](https://json-schema.org/) definitions. * From these JSON schema definitions, it is possible to generate large parts of the code of E-Invoice-EU.
de: * Alle Teile der Dokumentation sind vollständig untereinander verlinkt und relativ einfach zu verstehen. * Die Dokumentation wird aus Daten (see https://github.com/OpenPEPPOL/peppol-bis-invoice-3) generiert, aus denen sich [JSON-Schema-Definitionen](https://json-schema.org/) erzeugen lassen. * Es ist möglich, große Teile der Software aus diesen Schemata zu generieren.

source: As a result, it is easy to keep the implementation up-to-date with the current standards by Peppol.
de: Im Ergebnis ist es einfach, die Implementierung synchron mit den aktuellen Standards von Peppol zu halten.

# title
source: Supported Formats
de: Unterstützte Formate

# description
source: E-Invoice-EU supports e-invoice formats that conform to the European Standard EN16931.
de: E-Invoice-EU unterstützt E-Rechnungs-Formate, die der europäischen Norm EN16931 entsprechen.

source: E-Invoice-EU supports the following [e-invoice formats]([% q.llink(name='hybrid-vs-xml') %]):
de: E-Invoice-EU unterstützt die folgenden [E-Rechnungs-Formate]([% q.llink(name='hybrid-vs-xml') %]):

source: | Name | Customization ID/Remarks |-------------------|--------------------------- | CII | `urn:cen.eu:en16931:2017` | Factur-X-Minimum | `urn:factur-x.eu:1p0:minimum` | Factur-X-BasicWL | `urn:factur-x.eu:1p0:basicwl` | Factur-X-Basic-WL | is an alias for Factur-X-BasicWL | Factur-X-Basic | `'urn:cen.eu:en16931:2017#compliant#urn:factur-x.eu:1p0:basic'` | Factur-X-EN16931 | `urn:cen.eu:en16931:2017` | Factur-X-Comfort | is an alias for Factur-X-EN16931 | Factur-X-Extended | `urn:cen.eu:en16931:2017#conformant#urn:factur-x.eu:1p0:extended` | Factur-X-XRechung | `urn:cen.eu:en16931:2017#compliant#urn:xeinkauf.de:kosit:xrechnung_3.0` | UBL | `urn:cen.eu:en16931:2017` | XRECHNUNG-CII | `urn:cen.eu:en16931:2017#compliant#urn:xeinkauf.de:kosit:xrechnung_3.0` | XRECHNUNG-UBL | `urn:cen.eu:en16931:2017#compliant#urn:xeinkauf.de:kosit:xrechnung_3.0` | ZUGFeRD-Minimum | is an alias for Factur-X-Minimum | ZUGFeRD-BasicWL | is an alias for Factur-X-BasicWL | ZUGFeRD-Basic-WL | is an alias for Factur-X-BasicWL | ZUGFeRD-Basic | is an alias for Factur-X-Basic | ZUGFeRD-EN16931 | is an alias for Factur-X-EN16931 | ZUGFeRD-Comfort | is an alias for Factur-X-EN16931 | ZUGFeRD-Extended | is an alias for Factur-X-Extended | ZUGFeRD-XRechung | is an alias for Factur-X-XRechnung
de: | Name | Customization ID/Bemerkungen |-------------------|--------------------------- | CII | `urn:cen.eu:en16931:2017` | Factur-X-Minimum | `urn:factur-x.eu:1p0:minimum` | Factur-X-BasicWL | `urn:factur-x.eu:1p0:basicwl` | Factur-X-Basic-WL | is an alias for Factur-X-BasicWL | Factur-X-Basic | `’urn:cen.eu:en16931:2017#compliant#urn:factur-x.eu:1p0:basic’` | Factur-X-EN16931 | `urn:cen.eu:en16931:2017` | Factur-X-Comfort | ist ein Alias für Factur-X-EN16931 | Factur-X-Extended | `urn:cen.eu:en16931:2017#conformant#urn:factur-x.eu:1p0:extended` | Factur-X-XRechung | `urn:cen.eu:en16931:2017#compliant#urn:xeinkauf.de:kosit:xrechnung_3.0` | UBL | `urn:cen.eu:en16931:2017` | XRECHNUNG-CII | `urn:cen.eu:en16931:2017#compliant#urn:xeinkauf.de:kosit:xrechnung_3.0` | XRECHNUNG-UBL | `urn:cen.eu:en16931:2017#compliant#urn:xeinkauf.de:kosit:xrechnung_3.0` | ZUGFeRD-Minimum | ist ein Alias für Factur-X-Minimum | ZUGFeRD-BasicWL | ist ein Alias für Factur-X-BasicWL | ZUGFeRD-Basic-WL | ist ein Alias für Factur-X-BasicWL | ZUGFeRD-Basic | ist ein Alias für Factur-X-Basic | ZUGFeRD-EN16931 | ist ein Alias für Factur-X-EN16931 | ZUGFeRD-Comfort | ist ein Alias für Factur-X-EN16931 | ZUGFeRD-Extended | ist ein Alias für Factur-X-Extended | ZUGFeRD-XRechung | ist ein Alias für Factur-X-XRechnung

source: Please see the section [E-Invoice Formats]([% q.llink(name='hybrid-vs-xml') %]) for more information about customization ids and the different e-invoice formats.
de: Siehe den Abschnitt [E-Rechnungs-Formate]([% q.llink(name='hybrid-vs-xml') %]) für weiterführende Informationen über Customization-IDs und die unterschiedlichen E-Rechnungs-Formate.

# title
source: E-invoice Formats
de: E-Rechungs-Formate

# description
source: CII stands for Cross Industry Invoice.
de: CII steht für *Cross Industry Invoice*, also ungefähr branchenübergreifende Rechnung.

source: The other approved XML syntax for invoices in the EU is UN/CEFACT CII (United Nations Centre for Trade Facilitation and Electronic Business Cross Industry Invoice).
de: Die andere zulässige XML-Syntax für Rechnungen in der EU ist UN/CEFACT CII (United Nations Centre for Trade Facilitation and Electronic Business Cross Industry Invoice).

source: Unlike [% q.lanchor(name='ubl') %], the scope of CII is restricted to invoices; other document types are not supported. But that does not mean that the format is in any way simpler than UBL. In fact, the CII documentation is certainly not for the faint of heart.
de: Im Gegensatz zu [% q.lanchor(name='ubl') %] ist der Gültigkeitsbereich von CII auf Rechnungen beschränkt; andere Dokumententypen werden nicht unterstützt. Das bedeutet allerdings nicht, dass das Format in irgendeiner Form einfacher sei als UBL. Im Gegenteil, die CII-Dokumentation ist nichts für schwache Nerven.

source: CII can carry an overwhelming amount of information going far beyond the requirements of the European Standard EN16931. Currently, it is not possible to produce these additional elements with E-Invoice-EU.
de: Mit CII können eine Unmenge Informationen übermittelt werden, deren Umfang weit über das vom europäischen Standard EN16931 geforderte hinausgeht. Zur Zeit ist es nicht möglich, solche weitergehenden Informationen mit E-Invoice-EU zu übermitteln.

source: The documentation for [Factur-X](http://fnfe-mpe.org/factur-x/) and [ZUGFeRD](https://www.ferd-net.de/en/) describes the syntax and semantics of CII according to these standards but reading and using the documentation is a challenge of its own. Since E-Invoice-EU does not require a deeper understanding of CII, this is left as an exercise to the reader.
de: Die Dokumentation für [Factur-X](http://fnfe-mpe.org/factur-x/) und [ZUGFeRD](https://www.ferd-net.de/en/) beschreibt die Syntax und Semantik von CII im Kontext dieser Standards, wobei das Lesen und die Benutzung dieser Dokumentation eine Herausforderung ganz eigener Art darstellt. Weil E-Invoice-EU kein tiefergehendes Verständnis von CII erfordert, bleibt diese Herausforderung der Leserin oder dem Leser überlassen.

# title
source: Extensions
de: Erweiterungen

# description
source: Member states may define their own extensions to the standard in the form of Core Invoice Usage Specifications (CIUS)
de: Mitgliedsstaaten können ihre eigenen Erweiterung des Standards in Form von Core Invoice Usage Specifications - CIUS (ungefähr Spezifikationen für die Kernnutzung von Rechnungen) definieren.

source: You may expect from an e-invoice standard like EN16931 that it standardizes e-invoices. Not quite! Each member state can define their own extentions to the standard called Core Invoice Usage Specifications (CIUS). Notable examples are the standard "XRechnung" in Germany or "OIUBL" in Denmark, see the EU document [eInvoicing Country Factsheets for each Member State & other countries](https://ec.europa.eu/digital-building-blocks/sites/display/DIGITAL/eInvoicing+Country+Factsheets+for+each+Member+State+and+other+countries) for an overview.
de: Man könnte erwarten, dass ein Standard für E-Rechnungen wie EN16931 E-Rechnungen standardisiert. Dem ist nicht ganz so. Jeder Mitgliedsstaat kann seine eigenen Erweiterungen als Core Invoice Usage Specifications (CIUS) definieren. Prominente Beispiele dafür sid der Standard ”XRechnung” in Deutschland oder ”OIUBL” in Dänemark, siehe das EU-Dokument [eInvoicing Country Factsheets for each Member State & other countries](https://ec.europa.eu/digital-building-blocks/sites/display/DIGITAL/eInvoicing+Country+Factsheets+for+each+Member+State+and+other+countries) for an overview.

source: ## Which Extensions are Allowed?
de: ## Welche Erweiterungen sind erlaubt?

source: Fortunately, countries cannot arbitrarily change the standard.
de: Glücklicherweise können Mitgliedsländer den Standard beliebig ändern.

source: First of all, the allowed syntaxes are still only [% q.lanchor(name='ubl') %] and [% q.lanchor(name='cii') %].
de: Zunächst bleibt es bei [% q.lanchor(name='ubl') %] und [% q.lanchor(name='cii') %] als erlaubte Syntaxen.

source: Changes to the semantics are also restricted. Countries can, for example, make optional elements mandatory, restrict the number of occurrences of a certain element, or disallow usage of certain codes. See [CIUS and Extension - What is allowed](https://ec.europa.eu/digital-building-blocks/sites/display/DIGITAL/CIUS+and+Extension+-+What+is+allowed) for more information.
de: Änderungen an der Semantik sind ebenfalls eingeschränkt. So können Mitgliedsstaaten beispielsweise optionale Elemente zu Pflichtfeldern machen, die erlaubte Anzahl für das Vorkommen bestimmter Elemente einschränken oder die Verwendung gewisser Codes untersagen. Siehe [CIUS and Extension - What is allowed](https://ec.europa.eu/digital-building-blocks/sites/display/DIGITAL/CIUS+and+Extension+-+What+is+allowed) für weitergehende Informationen.

source: ## Practial Aspects
de: ## Praktische Aspekte

source: Both [% q.lanchor(name='ubl') %] and [% q.lanchor(name='cii') %] require the presence of a so-called [customization ID](https://docs.peppol.eu/poacc/billing/3.0/syntax/ubl-invoice/cbc-CustomizationID/). The customization ID is an opaque string like this:
de: Sowohl [% q.lanchor(name='ubl') %] als auch [% q.lanchor(name='cii') %] erfordern die Anwesenheit einer sogenannten [Customization-ID](https://docs.peppol.eu/poacc/billing/3.0/syntax/ubl-invoice/cbc-CustomizationID/). Die Customization-ID ist eine Zeichenkette wie diese:

source: It identifies a particular flavour of the e-invoice.
de: Sie identifiziert eine spezifische Variante einer E-Rechnung.

source: E-Invoice-EU facilitates this by defining aliases for certain formats. For example the alias "XRechnung" for the German extension automatically sets the customization id of the document to this:
de: E-Invoice-EU unterstützt diese, indem Aliase für verschiedene Formate definiert sind. So setzt zum Beispiel der Alias ”XRechnung” die Customization-ID auf diesen String:

source: If you want to produce a flavour that is not directly supported by E-Invoice-EU, you can simply select the base format (UBL or CII) and also specify the customization ID yourself like any other field. Explicitly specified customization IDs always override the built-in defaults.
de: Wenn man eine Variante, die nicht unmittelbar von E-Invoice-EU unterstützt wird, erzeugen will, wählt man einfach das Basis-Format (UBL or CII) und gibt daneben eine Customization-ID an. Explizit angegebene Customization-IDs überschreiben grundsätzlich die in die Software eingebauten Vorgabewerte.

source: Either way, it is your responsability to fulfill the semantic requirements of every country-specific flavour. E-Invoice-EU only checks that the structure of the invoice data adheres to the stipulations of the standard.
de: So oder so ist die Nutzerin oder der Nutzer selber dafür verantwortlich die inhaltlichen Anforderungen an die länderspezifische Variante zu erfüllen. E-Invoice-EU überprüft lediglich, dass die Struktur der Rechnungsdaten den Anforderungen des Standards genügen.

# description
source: Factur-X/ZUGFeRD invoices are special PDF documents with machine-readable invoice information attached as XML.
de: Factur-X/ZUGFeRD-Rechnungen sind spezielle PDEF-Dokumente mit maschinenlesbaren Rechnungsinformationen als XML-Anhang.

source: France and Germany have developed a different approach to e-invoicing with their respective standards Factur-X and ZUGFeRD. Beginning with version 2.1, the two standards are now identical.
de: Frankreich und Deutschland sind einen eigenen Web bei der Umsatzung der E-Rechnung gegangen und haben die jeweiligen Standards Factur-X und ZUGFeRD entwickelt. Seit Version 2.1 sind beide Standards nunmehr identisch.

source: ## PDF Attachments
de: ## PDF-Anhänge

source: While the pure XML formats [% q.lanchor(name='ubl') %] and [% q.lanchor(name='cii') %] can *optionally* embed a PDF version of an invoice, Factur-X/ZUGFeRD goes the opposite way. They are special PDFs with a machine-readable XML version of the invoice added to the PDF as an attachment.
de: Während in die reinen XML-Formate [% q.lanchor(name='ubl') %] and [% q.lanchor(name='cii') %] ein PDF *optional* einbetten können, geht Factur-X/ZUGFeRD den umgekehrten Weg. Bei diesem Format handelt es sich um spezielle PDFs, die eine maschinenlesbare XML-Version der Rechnung als Anhang eingebettet haben.

source: The ability to attach arbitrary documents to a PDF is one of the lesser known features of the Portable Document Format PDF and most PDF viewers do not allow you to see attachments to PDFs. However, Adobe Acrobat Reader has this feature.
de: Die Möglichkeit, beliebige Dokumente an ein PDF anzuhängen, ist eines der weniger bekannten Features des Portable Document Formats PDF, und die meisten PDF-Betrachter zeigen keine Anhänge an PDFs an. Der Adobe Acrobat Reader hat dieses Feature dagegen.

source: [% FILTER $Srcset alt="PDF Attachments in Adobe Acrobat Reader" %]/images/basics/e-invoice-formats/pdf-attachments-in-acrobat-reader.webp[% END %]
de: [% FILTER $Srcset alt="Flowchart der generellen Funktionsweise von E-Invoice-EU" %]/images/basics/general-mode-of-operation/flow-chart.webp[% END %]
