Repository: Magum23/e-invoice-eu
Catalog: packages/docs/_po/*.po
Languages: de

source: <h2>Disclaimer</h2>Accountability for content<br/>The contents of our pages have been created with the utmost care. However, we cannot guarantee the contents' accuracy, completeness or topicality. According to statutory provisions, we are furthermore responsible for our own content on these web pages. In this context, please note that we are accordingly not obliged to monitor merely the transmitted or saved information of third parties, or investigate circumstances pointing to illegal activity. Our obligations to remove or block the use of information under generally applicable laws remain unaffected by this as per &sect;&sect; 8 to 10 of the Telemedia Act (TMG).<br/><br/>Accountability for links<br/>Responsibility for the content of external links (to web pages of third parties) lies solely with the operators of the linked pages. No violations were evident to us at the time of linking. Should any legal infringement become known to us, we will remove the respective link immediately.<br/><br/>Copyright<br/> Our web pages and their contents are subject to German copyright law. Unless expressly permitted by law (&sect; 44a et seq. of the copyright law), every form of utilizing, reproducing or processing works subject to copyright protection on our web pages requires the prior consent of the respective owner of the rights. Individual reproductions of a work are allowed only for private use, so must not serve either directly or indirectly for earnings. Unauthorized utilization of copyrighted works is punishable (&sect; 106 of the copyright law).<br/><br/><i>Source: </i><a href="http://www.muster-vorlagen.net" target="_blank">Create legal disclosures online - http://www.muster-vorlagen.net</a><br/><br/>
de: <h2>Haftungsausschluss</h2> Haftung für Inhalte<br /> Die Inhalte unserer Seiten wurden mit größter Sorgfalt erstellt. Für die Richtigkeit, Vollständigkeit und Aktualität der Inhalte können wir jedoch keine Gewähr übernehmen. Als Diensteanbieter sind wir gemäß den gesetzlichen Bestimmungen für eigene Inhalte auf diesen Seiten verantwortlich. In diesem Zusammenhang möchten wir darauf hinweisen, dass wir nicht verpflichtet sind, übermittelte oder gespeicherte Informationen Dritter zu überwachen oder nach Umständen zu forschen, die auf eine rechtswidrige Tätigkeit hinweisen. Verpflichtungen zur Entfernung oder Sperrung der Nutzung von Informationen nach den allgemeinen Gesetzen bleiben hiervon gemäß §§ 8 bis 10 des Telemediengesetzes (TMG) unberührt.<br /><br /> Haftung für Links<br /> Verantwortlich für die Inhalte externer Links (zu Webseiten Dritter) sind ausschließlich die Betreiber der verlinkten Seiten. Zum Zeitpunkt der Verlinkung waren uns keine Rechtsverstöße ersichtlich. Sollten uns Rechtsverletzungen bekannt werden, werden wir derartige Links umgehend entfernen.<br /><br /> Urheberrecht<br /> Unsere Webseiten und deren Inhalte unterliegen dem deutschen Urheberrecht. Soweit nicht gesetzlich ausdrücklich erlaubt (§§ 44a ff. UrhG), bedarf jede Verwertung, Vervielfältigung oder Verarbeitung urheberrechtlich geschützter Werke auf unseren Webseiten der vorherigen Zustimmung des jeweiligen Rechteinhabers. Einzelne Vervielfältigungen eines Werkes sind nur für den privaten Gebrauch erlaubt und dürfen weder direkt noch indirekt Einnahmen erzielen. Die unbefugte Nutzung urheberrechtlich geschützter Werke ist strafbar (§ 106 UrhG).<br /><br /> <i>Quelle: </i><a href=”http://www.muster-vorlagen.net” target=”_blank”>Rechtliche Hinweise online erstellen - http://www.muster-vorlagen.net</a><br /><br />
